#include "stdio.h"
#include <stdlib.h>
#include <math.h>
float f(float x, float y, float z) {
    float a = x * x + 9.0f / 4.0f * y * y + z * z - 1;
    return a * a * a - x * x * z * z * z - 9.0f / 80.0f * y * y * z * z * z;
}

float h(float x, float z) {
    for (float y = 1.0f; y >= 0.0f; y -= 0.001f)
        if (f(x, y, z) <= 0.0f)
            return y;
    return 0.0f;
}
int main()
{

  int a;
  printf("Warning! 建议全屏使用该应用程度，首次启动需loading 几分钟........\n---------------------------------------------------------------------\n");
  printf("Warning! ZHI CHIN TANG please enter the number from zero to eleven!（press number then press enter)\n-----------------------------------------------------------------------------------------------------------\n");
  for(a=0;a<23;a++)
  {
      scanf("%d",&a);
      switch(a)
  {
  case 0:  printf("接下来数字要越来越大咯，除了规定数字还有两个彩蛋数字，只只自己想，加油！\n"); break;
  case 1:  printf("带只只去洛浦公园，果果从小就去的地方\n-------------------------------------------------------------\n");  break;
  case 2:  printf("带只只洛阳景区龙门石窟\n-------------------------------------------------------------\n"); break;
  case 3:  printf("带只只去洛邑古城，很好看的古城，在家附近\n-------------------------------------------------------------\n"); break;
  case 4:  printf("只只想要看movie\n-------------------------------------------------------------\n"); break;
  case 5:  printf("可能会去密室逃脱\n-------------------------------------------------------------\n"); break;
  case 6:  printf("剧本杀很好玩，像明星大侦探\n-------------------------------------------------------------\n"); break;
  case 7:  printf("明堂，果果也没去过\n-------------------------------------------------------------\n"); break;
  case 8:  printf("新区音乐喷泉 新街 新街桥，这些地方可以让只只放松一下\n-------------------------------------------------------------\n"); break;
  case 9:  printf("老城区 南大街小吃一条街，奶茶烧烤什么都有，要吃胖了！！\n-------------------------------------------------------------\n"); break;
  case 10:  printf("全家宴席，只只会怕怕_(:з」∠)_\n-------------------------------------------------------------\n"); break;
  case 11:  printf("还有好多呢果果还没想好，嘻\n-------------------------------------------------------------\n");
            printf("第一个彩蛋数字提示：果果最爱的女人的星座在几月\n-------------------------------------------------------------\n"); break;
  case 12 : printf("哼！只只靠果果猜出了第一个数，猜到这个数的奖励就是只只躺好被果果大力输出，让只只好好爽爽，每一下都插到最深的地方哦，狠狠地吸只只的咪咪哦，只只湿了吧嘻嘻嘻嘻嘻\n-------------------------------------------------------------\n第二个数靠你自己咯\n"); break;
  case 22 :  printf(" 只只真棒！最爱只只！送只只999朵爱心！\n-------------------------------------------------------------\n");



   int g;
   for (g=1;g<999;g++)
   {
       for (float z = 1.5f; z > -1.5f; z -= 0.05f) {
        for (float x = -1.5f; x < 1.5f; x += 0.025f) {
            float v = f(x, 0.0f, z);
            if (v <= 0.0f) {
                float y0 = h(x, z);
                float ny = 0.01f;
                float nx = h(x + ny, z) - y0;
                float nz = h(x, z + ny) - y0;
                float nd = 1.0f / sqrtf(nx * nx + ny * ny + nz * nz);
                float d = (nx + ny - nz) * nd * 0.5f + 0.5f;
                putchar(".:-=+*#%@"[(int)(d * 5.0f)]);
            }
            else
                putchar(' ');
        }
        putchar('\n');
    }
    }
  break;
  }
  }

  return 0;
}
